0deg_4Kenjeres/system/blockMeshDict
/*------------------------------*Agustín Villa*------------------------------*\																	
| =========                 |                                                 |																	
| \\      /  F ield         | OpenFOAM:                      |																	
|  \\    /   O peration     | Files are generated by Agustín Villa (based on )              |																	
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |																	
|    \\/     M anipulation  |         PhanQuocThien@gmail.com                 |																	
\*---------------------------------------------------------------------------*/																	
FoamFile																	
{																	
    version     2.0;																	
    format      ascii;																	
    class       dictionary;																	
    object      blockMeshDict;																	
}																	
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //																	
convertToMeters	1	;															
																	
geometry																	
{																	
}																	
																	
vertices																	
(																	
	(	0	0	0	)	//	0										
	(	1	0	0	)	//	1										
	(	1	10	0	)	//	2										
	(	-9	0	0	)	//	3										
	(	0	0	0.3	)	//	4										
	(	1	0	0.3	)	//	5										
	(	1	10	0.3	)	//	6										
	(	-9	0	0.3	)	//	7										
	(	13	2.25742631	0	)	//	8										
	(	13	10	0	)	//	9										
	(	13	2.25742631	0.3	)	//	10										
	(	13	10	0.3	)	//	11										
	(	1	-10	0	)	//	12										
	(	1	-10	0.3	)	//	13										
	(	13	-10	0	)	//	14										
	(	13	-10	0.3	)	//	15										
	(	1	0	0	)	//	16										
	(	1	0	0.3	)	//	17										
																	
);																	
																	
																	
blocks																	
(																	
	hex	(0	1	2	3	4	5	6	7)	(	190	114	1	)	//block	1	
	edgeGrading																
	(																
	//	x-direction	expansion	ratio													
	(																
(	0.4	0.4	1.1	)													
(	0.6	0.6	0.909090909	)													
	)																
	0.005	0.005															
	(																
(	0.4	0.4	1.1	)													
(	0.6	0.6	0.909090909	)													
	)																
	//	y-direction	expansion	ratio													
	(																
(	0.03	0.421052632	97.01723378	)													
(	0.97	0.578947368	5.153723524	)													
	)																
	(																
(	0.03	0.421052632	97.01723378	)													
(	0.97	0.578947368	5.153723524	)													
	)																
	(																
(	0.03	0.421052632	97.01723378	)													
(	0.97	0.578947368	5.153723524	)													
	)																
	(																
(	0.03	0.421052632	97.01723378	)													
(	0.97	0.578947368	5.153723524	)													
	)																
																	
	//	z-direction	expansion	ratio													
	1	1	1	1													
	)																
																	
	hex	(1	8	9	2	5	10	11	6)	(	49	114	1)	//block	2		
	edgeGrading																
	(																
	//	x-direction	expansion	ratio													
	200	200	200	200													
	//	y-direction	expansion	ratio													
	(																
(	0.03	0.421052632	97.01723378	)													
(	0.97	0.578947368	5.153723524	)													
	)																
	8.901886087	8.901886087															
	(																
(	0.03	0.421052632	97.01723378	)													
(	0.97	0.578947368	5.153723524	)													
	)																
																	
	//	z-direction	expansion	ratio													
	1	1	1	1													
	)																
																	
	hex	(3	12	16	0	7	13	17	4)	(	190	114	1	)	//block	3	
	edgeGrading																
	(																
	//	x-direction	expansion	ratio													
	0.005																
	(																
(	0.4	0.4	1.1	)													
(	0.6	0.6	0.909090909	)													
	)																
	(																
(	0.4	0.4	1.1	)													
(	0.6	0.6	0.909090909	)													
	)																
	0.005																
	//	y-direction	expansion	ratio													
	(																
(	0.97	0.578947368	0.194034468	)													
(	0.03	0.421052632	0.010307447	)													
	)																
	(																
(	0.97	0.578947368	0.194034468	)													
(	0.03	0.421052632	0.010307447	)													
	)																
	(																
(	0.97	0.578947368	0.194034468	)													
(	0.03	0.421052632	0.010307447	)													
	)																
	(																
(	0.97	0.578947368	0.194034468	)													
(	0.03	0.421052632	0.010307447	)													
	)																
																	
	//	z-direction	expansion	ratio													
	1	1	1	1													
	)																
																	
																	
																	
																	
																	
	hex	(12	14	8	16	13	15	10	17)	(	49	114	1)	//block	4		
	edgeGrading																
	(																
	//	x-direction	expansion	ratio													
	200	200	200	200													
	//	y-direction	expansion	ratio													
	(																
(	0.97	0.578947368	0.194034468	)													
(	0.03	0.421052632	0.010307447	)													
	)																
	0.112335744	0.112335744															
	(																
(	0.97	0.578947368	0.194034468	)													
(	0.03	0.421052632	0.010307447	)													
	)																
																	
	//	z-direction	expansion	ratio													
	1	1	1	1													
	)																
);																	
																	
																	
edges																	
(																	
	arc	3 2	(	-6.071067812	7.071067812	0	)										
	arc	7 6	(	-6.071067812	7.071067812	0.3	)										
																	
	spline	1	0														
	(																
	(	0.999013	0.000143	0	)												
	(	0.996057	0.000572	0	)												
	(	0.991144	0.00128	0	)												
	(	0.984292	0.00226	0	)												
	(	0.975528	0.003501	0	)												
	(	0.964888	0.00499	0	)												
	(	0.952414	0.00671	0	)												
	(	0.938153	0.008643	0	)												
	(	0.922164	0.01077	0	)												
	(	0.904508	0.013071	0	)												
	(	0.885257	0.015523	0	)												
	(	0.864484	0.018106	0	)												
	(	0.842274	0.020795	0	)												
	(	0.818712	0.023569	0	)												
	(	0.793893	0.026405	0	)												
	(	0.767913	0.029279	0	)												
	(	0.740877	0.032168	0	)												
	(	0.71289	0.035048	0	)												
	(	0.684062	0.037896	0	)												
	(	0.654508	0.040686	0	)												
	(	0.624345	0.043394	0	)												
	(	0.593691	0.045992	0	)												
	(	0.562667	0.048455	0	)												
	(	0.531395	0.050754	0	)												
	(	0.5	0.052862	0	)												
	(	0.468605	0.054749	0	)												
	(	0.437333	0.05639	0	)												
	(	0.406309	0.057755	0	)												
	(	0.375655	0.058819	0	)												
	(	0.345492	0.059557	0	)												
	(	0.315938	0.059947	0	)												
	(	0.28711	0.059971	0	)												
	(	0.259123	0.059614	0	)												
	(	0.232087	0.058863	0	)												
	(	0.206107	0.057712	0	)												
	(	0.181288	0.056159	0	)												
	(	0.157726	0.054206	0	)												
	(	0.135516	0.051862	0	)												
	(	0.114743	0.049138	0	)												
	(	0.095492	0.046049	0	)												
	(	0.077836	0.042615	0	)												
	(	0.061847	0.038859	0	)												
	(	0.047586	0.034803	0	)												
	(	0.035112	0.030473	0	)												
	(	0.024472	0.025893	0	)												
	(	0.015708	0.021088	0	)												
	(	0.008856	0.016078	0	)												
	(	0.003943	0.010884	0	)												
	(	0.000987	0.005521	0	)												
	)																
																	
																	
	spline	5	4														
	(																
	(	0.999013	0.000143	0.3	)												
	(	0.996057	0.000572	0.3	)												
	(	0.991144	0.00128	0.3	)												
	(	0.984292	0.00226	0.3	)												
	(	0.975528	0.003501	0.3	)												
	(	0.964888	0.00499	0.3	)												
	(	0.952414	0.00671	0.3	)												
	(	0.938153	0.008643	0.3	)												
	(	0.922164	0.01077	0.3	)												
	(	0.904508	0.013071	0.3	)												
	(	0.885257	0.015523	0.3	)												
	(	0.864484	0.018106	0.3	)												
	(	0.842274	0.020795	0.3	)												
	(	0.818712	0.023569	0.3	)												
	(	0.793893	0.026405	0.3	)												
	(	0.767913	0.029279	0.3	)												
	(	0.740877	0.032168	0.3	)												
	(	0.71289	0.035048	0.3	)												
	(	0.684062	0.037896	0.3	)												
	(	0.654508	0.040686	0.3	)												
	(	0.624345	0.043394	0.3	)												
	(	0.593691	0.045992	0.3	)												
	(	0.562667	0.048455	0.3	)												
	(	0.531395	0.050754	0.3	)												
	(	0.5	0.052862	0.3	)												
	(	0.468605	0.054749	0.3	)												
	(	0.437333	0.05639	0.3	)												
	(	0.406309	0.057755	0.3	)												
	(	0.375655	0.058819	0.3	)												
	(	0.345492	0.059557	0.3	)												
	(	0.315938	0.059947	0.3	)												
	(	0.28711	0.059971	0.3	)												
	(	0.259123	0.059614	0.3	)												
	(	0.232087	0.058863	0.3	)												
	(	0.206107	0.057712	0.3	)												
	(	0.181288	0.056159	0.3	)												
	(	0.157726	0.054206	0.3	)												
	(	0.135516	0.051862	0.3	)												
	(	0.114743	0.049138	0.3	)												
	(	0.095492	0.046049	0.3	)												
	(	0.077836	0.042615	0.3	)												
	(	0.061847	0.038859	0.3	)												
	(	0.047586	0.034803	0.3	)												
	(	0.035112	0.030473	0.3	)												
	(	0.024472	0.025893	0.3	)												
	(	0.015708	0.021088	0.3	)												
	(	0.008856	0.016078	0.3	)												
	(	0.003943	0.010884	0.3	)												
	(	0.000987	0.005521	0.3	)												
	)																
																	
																	
	arc	3 12	(	-6.071067812	-7.071067812	0	)										
	arc	7 13	(	-6.071067812	-7.071067812	0.3	)										
																	
	spline	0	16														
	(																
	(	0.000987	-0.005521	0	)												
	(	0.003943	-0.010884	0	)												
	(	0.008856	-0.016078	0	)												
	(	0.015708	-0.021088	0	)												
	(	0.024472	-0.025893	0	)												
	(	0.035112	-0.030473	0	)												
	(	0.047586	-0.034803	0	)												
	(	0.061847	-0.038859	0	)												
	(	0.077836	-0.042615	0	)												
	(	0.095492	-0.046049	0	)												
	(	0.114743	-0.049138	0	)												
	(	0.135516	-0.051862	0	)												
	(	0.157726	-0.054206	0	)												
	(	0.181288	-0.056159	0	)												
	(	0.206107	-0.057712	0	)												
	(	0.232087	-0.058863	0	)												
	(	0.259123	-0.059614	0	)												
	(	0.28711	-0.059971	0	)												
	(	0.315938	-0.059947	0	)												
	(	0.345492	-0.059557	0	)												
	(	0.375655	-0.058819	0	)												
	(	0.406309	-0.057755	0	)												
	(	0.437333	-0.05639	0	)												
	(	0.468605	-0.054749	0	)												
	(	0.5	-0.052862	0	)												
	(	0.531395	-0.050754	0	)												
	(	0.562667	-0.048455	0	)												
	(	0.593691	-0.045992	0	)												
	(	0.624345	-0.043394	0	)												
	(	0.654508	-0.040686	0	)												
	(	0.684062	-0.037896	0	)												
	(	0.71289	-0.035048	0	)												
	(	0.740877	-0.032168	0	)												
	(	0.767913	-0.029279	0	)												
	(	0.793893	-0.026405	0	)												
	(	0.818712	-0.023569	0	)												
	(	0.842274	-0.020795	0	)												
	(	0.864484	-0.018106	0	)												
	(	0.885257	-0.015523	0	)												
	(	0.904508	-0.013071	0	)												
	(	0.922164	-0.01077	0	)												
	(	0.938153	-0.008643	0	)												
	(	0.952414	-0.00671	0	)												
	(	0.964888	-0.00499	0	)												
	(	0.975528	-0.003501	0	)												
	(	0.984292	-0.00226	0	)												
	(	0.991144	-0.00128	0	)												
	(	0.996057	-0.000572	0	)												
	(	0.999013	-0.000143	0	)												
	)																
																	
																	
	spline	4	17														
	(																
	(	0.000987	-0.005521	0.3	)												
	(	0.003943	-0.010884	0.3	)												
	(	0.008856	-0.016078	0.3	)												
	(	0.015708	-0.021088	0.3	)												
	(	0.024472	-0.025893	0.3	)												
	(	0.035112	-0.030473	0.3	)												
	(	0.047586	-0.034803	0.3	)												
	(	0.061847	-0.038859	0.3	)												
	(	0.077836	-0.042615	0.3	)												
	(	0.095492	-0.046049	0.3	)												
	(	0.114743	-0.049138	0.3	)												
	(	0.135516	-0.051862	0.3	)												
	(	0.157726	-0.054206	0.3	)												
	(	0.181288	-0.056159	0.3	)												
	(	0.206107	-0.057712	0.3	)												
	(	0.232087	-0.058863	0.3	)												
	(	0.259123	-0.059614	0.3	)												
	(	0.28711	-0.059971	0.3	)												
	(	0.315938	-0.059947	0.3	)												
	(	0.345492	-0.059557	0.3	)												
	(	0.375655	-0.058819	0.3	)												
	(	0.406309	-0.057755	0.3	)												
	(	0.437333	-0.05639	0.3	)												
	(	0.468605	-0.054749	0.3	)												
	(	0.5	-0.052862	0.3	)												
	(	0.531395	-0.050754	0.3	)												
	(	0.562667	-0.048455	0.3	)												
	(	0.593691	-0.045992	0.3	)												
	(	0.624345	-0.043394	0.3	)												
	(	0.654508	-0.040686	0.3	)												
	(	0.684062	-0.037896	0.3	)												
	(	0.71289	-0.035048	0.3	)												
	(	0.740877	-0.032168	0.3	)												
	(	0.767913	-0.029279	0.3	)												
	(	0.793893	-0.026405	0.3	)												
	(	0.818712	-0.023569	0.3	)												
	(	0.842274	-0.020795	0.3	)												
	(	0.864484	-0.018106	0.3	)												
	(	0.885257	-0.015523	0.3	)												
	(	0.904508	-0.013071	0.3	)												
	(	0.922164	-0.01077	0.3	)												
	(	0.938153	-0.008643	0.3	)												
	(	0.952414	-0.00671	0.3	)												
	(	0.964888	-0.00499	0.3	)												
	(	0.975528	-0.003501	0.3	)												
	(	0.984292	-0.00226	0.3	)												
	(	0.991144	-0.00128	0.3	)												
	(	0.996057	-0.000572	0.3	)												
	(	0.999013	-0.000143	0.3	)												
	)																
																	
																	
);																	
																	
faces																	
(																	
																	
);																	
																	
faces																	
(																	
  																	
);																	
																	
																	
defaultPatch																	
{																	
    name frontAndBack;																	
    type empty;																	
}																	
																	
boundary																	
(																	
inlet              // patch name																	
        {																	
            type patch;    // patch type for patch 0																	
            faces																	
            (																	
                (9 2 6 11)  // block face in this patch																	
                (2 3 7 6  )  // block face in this patch																	
                (3 12 13 7  )  // block face in this patch																	
                (12 15 14 13  )  // block face in this patch																	
            );																	
        }																	
																	
outlet              // patch name																	
        {																	
            type patch;    // patch type for patch 0																	
            faces																	
            (																	
                (8 9 10 11)  // block face in this patch																	
                (15 8 10 14  )  // block face in this patch																	
            );																	
        }																	
																	
walls              // patch name																	
        {																	
            type wall;    // patch type for patch 0																	
            faces																	
            (																	
                (0 1 5 4)  // block face in this patch																	
                (0 4 17 16  )  // block face in this patch																	
            );																	
        }																	
																	
interface1              // patch name																	
        {																	
            type patch;    // patch type for patch 0																	
            faces																	
            (																	
                (1 8 10 5)  // block face in this patch																	
            );																	
        }																	
interface2              // patch name																	
        {																	
            type patch;    // patch type for patch 0																	
            faces																	
            (																	
                (16 17 10 8)  // block face in this patch																	
            );																	
        }																	
);																	
																	
 mergePatchPairs																	
(																	
    ( interface1 interface2 )																	
);																	
// ************************************************************************* //																	
